# тип данных - обобщенное название значения

a = 1234 # переменная с именем а обладает значением 1234, а тип этого значение int
b = 123.456  # переменная с именем b обладает значением 123.456, а тип этого значение float
c = "1234567" # переменная с именем c обладает значением 123.456, а тип этого значение str
d = True # переменная с именем d обладает значением True, а тип этого значение bool
# ВСЕ ЧТО В КАВЫЧКАХ ЭТО СТРОКИ

# print(type(b)) то же самое что print(type(123.456))
















# 1. Вводится число с клавиатуры. Если оно четное, то написать "ч", если нечетное то "н"
# h = int(input())
# if h % 2 == 0:
#     print("ч")
# else:
#     print("н")
















