# создание переменной: имяПеременной = значениеПеременной

# типы данных: int - целое число, float - дробное число, str - строчка

# Var - сокращение от Variable (с английского – переменная)

intVar = 123456 # никаких дополнительных символов

floatVar = 3.1415 # целаяЧастьЧисла.дробнаяЧасть числа

strVar = "Hello!" # строчки всегда пишутся в кавычках
# причем кавычка может быть как одинарная ('), так и двойная (")
# главное, чтобы открывающая кавычка была такой же, как и закрывающая


# функция print(...) выводит в консоль одно или несколько значений
print(1, 2, 3) # выведет 1 2 3

name = "Аня"
print("Привет", name) # выведет Привет, Аня

# функиця input() вводит с клавиатуры
a = input() # когда напишешь что-то в консоль, то переменная a станет равна тому, что написала


# возвращаемся к типам данных
# a = input()          ввод переменной a с типом str (строчка)
# a = int(input())     ввод переменной a с типом int (целое число)
# a = float(input())          ввод переменной a с типом float (дробное число)

